import React from 'react' ;
import {
  Text,
  View,
} from "react-native";
import { KeyboardAwareScrollView } from "react-native-keyboard-aware-scroll-view";
import styles from "./styles";


export default function RegistrationScreen({ navigation }) {
  


return (

  <View style={styles.container}>
  <KeyboardAwareScrollView
    style={{ flex: 1, width: "100%" }}
    keyboardShouldPersistTaps="always"
  >

    <Text style={styles.Title}> السياسة والأحكام</Text>
    <Text style={styles.t1}>
    بمجرد استخدامك لهذا الموقع، فإنك توافق على الالتزام بكافة شروط {"\n"}وأحكام الاستخدام الواردة.
     ويحق لفريق أفاد تعديل أو تغيير هذه الشروط والأحكام في أي وقت تراه مناسباً. 

    ويكون مستخدم هذا الموقع ("المستخدم") ملتزمًا بتلك التعديلات أو التغييرات سواء
     أطلع عليها من قبل أم لم يطلع . وفي حالة عدم موافقة المستخدم على هذه الشروط والأحكام،
     .ينبغي عليه عدم استخدام هذا الموقع تماما
</Text>

<Text style={styles.Title}>
{"\n"}

سياسة سرية المعلومات والأفصاح
</Text>

<Text style={styles.t1}>

١-المشاريع التجارية الباحثة عن خطط عمل أو رأس مال
 {"\n"}٢- المستثمرين المُحتملين الباحثين عن استثمارات في المشاريع
 {"\n"}٣- داعمين الأعمال والمشاريع الباحثين عن مشاريع وأعمال لدعمها
 {"\n"} {"\n"}
ويمكن للمشاريع القيام بعرض المعلومات الخاصة بها وذلك بغرض تنظيمها حسابياً وعرضها للمراجعة من قبل داعمي المشاريع
 والمستثمرين ويجب التنبيه إلى : {"\n"}أن أفاد والعاملين فيها ليسوا وكلاء أو ممثلين أو ضامنين في استثمار في الأوراق المالية 
 إضافة إلى أن أفاد والعاملين فيها لا يتحملون أي مسؤولية عن مدى نظامية استثمارات كهذه وفق أنظمة السوق المالية في المملكة العربية السعودية
  أو أي دولة اخرى  كما أن جميع المعلومات والبيانات المطروحة والمزودة في هذا الموقع أو أي موقع آخر يرتبط بهذا الموقع مباشرة هي تستخدم فقط لأغراض معلوماتية
 وينبغي على كل مستثمر القيام بكافة واجباته والتزاماته القانونية واتخاذ العناية اللازمة وسؤال الأسئلة وتلقي الإجابات والحصول
  على معلومات إضافية وإجراء العناية اللازمة حول أي استثمار يقوم به ويجب أن تتوافق جميع الاستثمارات مع الأنظمة والقوانين في المكان الذي تتم فيه عملية شراء أو عرض أو بيع الأوراق المالية
</Text>

<Text style={styles.Title}>
{"\n"}

سياسة الموافقة الحسابات
</Text>



<Text style={styles.t1}>
يمتلك أفاد الحق في عدم قبول الحسابات الشخصية التي لا تتوافق مع معايير الجودة والسياسات الخاصة بأفاد. ويخطر عاملي أفاد عن أي تغيير أو تحديث يطرأ على أي حساب شخصي، ويحق لعاملي أفاد عدم قبول إنشاء أو تحديث أي حساب. ولمعرفة كيف يتم الموافقة على حساب المستخدم من عدمها، يمكنك التواصل مع افاد عبر afaad.manager@gmail.com
</Text>

</KeyboardAwareScrollView>
</View>
);


}